index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-05-29 Mon 17:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org4b0f33b">1. Description</a>
<ul>
<li><a href="#org0441c7a">1.1. Course Learning Outcomes &amp; Objectives</a></li>
</ul>
</li>
<li><a href="#org7e8ebd1">2. Due Dates</a></li>
<li><a href="#org43d549e">3. Course Outline</a></li>
<li><a href="#orgbcc0c30">4. Exams</a></li>
<li><a href="#orgd7218f5">5. Attendance/Participation</a></li>
<li><a href="#orgab1a96f">6. Grading</a>
<ul>
<li><a href="#orgec3f979">6.1. An Important Note on Grading</a></li>
</ul>
</li>
<li><a href="#org78fe3a8">7. How To Ask Questions</a></li>
<li><a href="#orgfdbbe97">8. Email Communication</a></li>
<li><a href="#orgfc2f4ae">9. Guidelines and Accommodations</a>
<ul>
<li><a href="#orgd36ad63">9.1. Accommodations for Students with Disabilities</a></li>
</ul>
</li>
<li><a href="#orga264905">10. Bonus Project Ideas</a>
<ul>
<li><a href="#org1139ced">10.1. The Pairs Trade</a></li>
<li><a href="#org3e0a2f0">10.2. Classify Failed Banks with a Deep Neural Network</a></li>
<li><a href="#org1bfd98f">10.3. Algorithm Identification in High-Frequency Markets</a></li>
<li><a href="#orgb2442d5">10.4. Determining the Effect of Bank Capital Adequacy Requirements</a></li>
<li><a href="#orgf01d74e">10.5. Bank Stress Testing</a></li>
<li><a href="#org8c81da2">10.6. Machine Learning in Portfolio Construction</a></li>
<li><a href="#orgb1214a1">10.7. Constructing an Artificial Intelligence Investment Advisor</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class="org-center">
<p>
SUNY POLYTECHNIC INSTITUTE
</p>

<p>
SCHOOL OF BUSINESS ADMINISTRATION
</p>
</div>
<p>
<br />
<br />
</p>
<div class="org-center">
<p>
<b><b>FIN 420: FINANCIAL ANALYTICS</b></b>
</p>
</div>
<p>
<br />
<br />
<b><b>Instructor</b></b>: Matthew Brigida, Ph.D.<br />
<br />
<b><b>Office</b></b>: Donovan 1277<br />
<br />
<b><b>Office Hours</b></b>: On request.<br />
<br />
<b><b>Email</b></b>:  matthew.brigida@sunypoly.edu<br />
<br />
<b><b>Class Location</b></b>: Online Asynchronous<br />
<br />
</p>

<p>
<br />
<b><b>Supplementary Texts/Materials</b></b>:
</p>

<ul class="org-ul">
<li><a href="https://financial-education.github.io/">Financial Education</a></li>
</ul>

<div id="outline-container-org4b0f33b" class="outline-2">
<h2 id="org4b0f33b"><span class="section-number-2">1.</span> Description</h2>
<div class="outline-text-2" id="text-1">
<p>
An overview of analytical methods used in finance, and their applications.  Particular focus will be paid to methods for handling large data sets used in high-frequency trading, and machine learning and artificial intelligence methods applied to banking, investments, and energy markets.
</p>
</div>

<div id="outline-container-org0441c7a" class="outline-3">
<h3 id="org0441c7a"><span class="section-number-3">1.1.</span> Course Learning Outcomes &amp; Objectives</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>CLO 1. Technical Competence: Adept in applying analytics technology to solve institutional problems and enable effective financial decision making.</li>
<li>CLO 2. Analytical Problem Framing: Demonstrate individual capacity to evaluate and deploy analytical methods selected from a diverse portfolio of tools analyze and manage common financial decisions.</li>
<li>CLO 3. Strategic and Integrative Thinking: Understand the baseline resources available for analyzing and managing a firm’s financial performance. Including collecting data, processing information and evaluating and communicating outcomes with partners; differentiate between the accounting function as a preparer of data and information and the finance function as a user of information for decision making and the role of ethics in the process.</li>
<li>CLO 4. Leadership and Communication: Be capable of expressing key concepts and terms commonly used in financial analytics; by using effective written, oral and interpersonal communications to contribute to the financial performance of financial firms.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org7e8ebd1" class="outline-2">
<h2 id="org7e8ebd1"><span class="section-number-2">2.</span> Due Dates</h2>
<div class="outline-text-2" id="text-2">
<p>
Assignments 1 through 6 are due June 30.  Assignments 7 through 12 are due July 23.  
</p>
</div>
</div>


<div id="outline-container-org43d549e" class="outline-2">
<h2 id="org43d549e"><span class="section-number-2">3.</span> Course Outline</h2>
<div class="outline-text-2" id="text-3">
<p>
See the weekly Colab Notebook links and videos in the Content section of our course in BB.
</p>
</div>
</div>

<div id="outline-container-orgbcc0c30" class="outline-2">
<h2 id="orgbcc0c30"><span class="section-number-2">4.</span> Exams</h2>
<div class="outline-text-2" id="text-4">
<p>
There are no exams scheduled, however a final exam may be added at the instructor's discretion. 
</p>
</div>
</div>

<div id="outline-container-orgd7218f5" class="outline-2">
<h2 id="orgd7218f5"><span class="section-number-2">5.</span> Attendance/Participation</h2>
<div class="outline-text-2" id="text-5">
<p>
You will receive participation points for using the discussion board to ask and answer questions.  Sending me emails asking non-personal course related questions (against the course communication policy) will cause you to lose participation points.
</p>
</div>
</div>

<div id="outline-container-orgab1a96f" class="outline-2">
<h2 id="orgab1a96f"><span class="section-number-2">6.</span> Grading</h2>
<div class="outline-text-2" id="text-6">
<div class="org-center">
<p>

</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Item</th>
<th scope="col" class="org-right">Points</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Assignments</td>
<td class="org-right">90</td>
</tr>

<tr>
<td class="org-left">Attendance/Participation</td>
<td class="org-right">10</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Total Points</td>
<td class="org-right">100</td>
</tr>
</tbody>
</table>
</div>

<p>
Final grades will be assigned according to the A+, A, A-, etc scale.
</p>
</div>


<div id="outline-container-orgec3f979" class="outline-3">
<h3 id="orgec3f979"><span class="section-number-3">6.1.</span> An Important Note on Grading</h3>
<div class="outline-text-3" id="text-6-1">
<blockquote>
<p>
There is no special consideration if you need a certain grade in this course to graduate.  <b><b>If you require a certain grade in this class to graduate it is your responsibility to earn that grade.</b></b> Specifically if you receive a `D` in this course I will not allow you to do extra assignments after the course is complete in exchange for a higher grade. 
</p>
</blockquote>
</div>
</div>
</div>

<div id="outline-container-org78fe3a8" class="outline-2">
<h2 id="org78fe3a8"><span class="section-number-2">7.</span> How To Ask Questions</h2>
<div class="outline-text-2" id="text-7">
<p>
The more information you provide, the more likely I will be able to answer your question.  If you simply say "I got an error" then you should not expect anyone to be able to help.  At the very least provide the text of the error.
</p>

<p>
<a href="https://stackoverflow.com/help/how-to-ask">See this post.</a>  
</p>
</div>
</div>

<div id="outline-container-orgfdbbe97" class="outline-2">
<h2 id="orgfdbbe97"><span class="section-number-2">8.</span> Email Communication</h2>
<div class="outline-text-2" id="text-8">
<p>
Questions about course material should be posted to the most relevant discussion board.  Email should only be used for personal matters.  When sending an email, be sure to put the course in the subject line (FIN 420). 
</p>
</div>
</div>

<div id="outline-container-orgfc2f4ae" class="outline-2">
<h2 id="orgfc2f4ae"><span class="section-number-2">9.</span> Guidelines and Accommodations</h2>
<div class="outline-text-2" id="text-9">
<p>
Academic Integrity Policy Students Enrolled in this course are required to understand and fully comply with all aspects of the Academic Integrity Policy as described in the SUNY Polytechnic Institute Handbook (available at:  <a href="https://sunypoly.edu/pdf/student_handbook.pdf">https://sunypoly.edu/pdf/student_handbook.pdf</a> )
</p>
</div>

<div id="outline-container-orgd36ad63" class="outline-3">
<h3 id="orgd36ad63"><span class="section-number-3">9.1.</span> Accommodations for Students with Disabilities</h3>
<div class="outline-text-3" id="text-9-1">
<blockquote>
<p>
In compliance with the Americans with Disabilities Act of 1990 and Section 504 of the Rehabilitation Act, SUNY Polytechnic Institute is committed to ensuring comprehensive educational access and accommodations for all registered students seeking access to meet course requirements and fully participate in programs and activities.  Students with documented disabilities or medical conditions are encouraged to request these services by registering with the Office of Disability Services. Please request accommodations early in the semester, or as soon as you become registered with Disability Services, so that we have adequate time to arrange your approved academic accommodation/s.  Once Disability Services creates your accommodation plan, it is your responsibility to provide me a copy of the accommodation plan.
</p>

<p>
If you experience any access concerns that may require the need for adaptive or alternate format/presentation of materials, reach out to me or Disability Services right away. 
</p>

<p>
For information related to these services or to schedule an appointment, please contact the Office of Disability Services using the information provided below.  The Office of Disability Services can accommodate virtual meeting requests.  The website has helpful information, and the link can be found here: <a href="https://sunypoly.edu/student-life/diversity-equity-inclusion/disabilities-services/contact-us.html">https://sunypoly.edu/student-life/diversity-equity-inclusion/disabilities-services/contact-us.html</a>
</p>
</blockquote>
</div>
</div>
</div>

<div id="outline-container-orga264905" class="outline-2">
<h2 id="orga264905"><span class="section-number-2">10.</span> Bonus Project Ideas</h2>
<div class="outline-text-2" id="text-10">
<p>
None of these are necessary, and should not take the place of any assigned work.
</p>
</div>
<div id="outline-container-org1139ced" class="outline-3">
<h3 id="org1139ced"><span class="section-number-3">10.1.</span> The Pairs Trade</h3>
</div>
<div id="outline-container-org3e0a2f0" class="outline-3">
<h3 id="org3e0a2f0"><span class="section-number-3">10.2.</span> Classify Failed Banks with a Deep Neural Network</h3>
</div>
<div id="outline-container-org1bfd98f" class="outline-3">
<h3 id="org1bfd98f"><span class="section-number-3">10.3.</span> Algorithm Identification in High-Frequency Markets</h3>
</div>
<div id="outline-container-orgb2442d5" class="outline-3">
<h3 id="orgb2442d5"><span class="section-number-3">10.4.</span> Determining the Effect of Bank Capital Adequacy Requirements</h3>
</div>
<div id="outline-container-orgf01d74e" class="outline-3">
<h3 id="orgf01d74e"><span class="section-number-3">10.5.</span> Bank Stress Testing</h3>
</div>
<div id="outline-container-org8c81da2" class="outline-3">
<h3 id="org8c81da2"><span class="section-number-3">10.6.</span> Machine Learning in Portfolio Construction</h3>
</div>
<div id="outline-container-orgb1214a1" class="outline-3">
<h3 id="orgb1214a1"><span class="section-number-3">10.7.</span> Constructing an Artificial Intelligence Investment Advisor</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2023-05-29 Mon 17:14</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>